// pages/eventMsg/eventMsg.js
Page({
  /**
   * 页面的初始数据
   */
  data: {
    content:
      '<p> #文艺部通知#</p><p>为引导学生提高艺术品位，陶冶情操，营造有利于青年学生健康成长的校园文化氛围，融入爱国主义思想，舞动爱国情操，展现出我校南师学子心系祖国、与祖国的脉搏一起跃动的良好精神面貌，特此举办“绚丽南师梦 舞动卧龙情”校园舞蹈大赛。</p><p>🔥🔥活动要求</p><p>1.参赛舞蹈舞种不限，可以是民族舞、现代舞等舞种；</p><p>2.组织形式不限，可以是独舞、群舞、组合等形式</p><p>🔥🔥活动形式</p><p>初赛，复赛，决赛</p><p>🔥🔥活动时间</p><p>初步定在10月13号晚七点，地点另行通知</p><p>🔥🔥请各位班委在10月13号中午十二点前将本班报名表钉钉发给文艺部干事顾一洺，并通知报名的同学扫描下方二维码加入QQ群，活动结束会有相应量化加成，请大家踊跃报名</p><p><br/></p>'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {},

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {},

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {},

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {},

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {},

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {},

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {},

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {}
})
